-- phpMyAdmin SQL Dump
-- version 3.5.7
-- http://www.phpmyadmin.net
--
-- Хост: localhost
-- Время создания: Окт 15 2014 г., 15:05
-- Версия сервера: 5.6.15
-- Версия PHP: 5.3.28

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- База данных: `lab3`
--

-- --------------------------------------------------------

--
-- Структура таблицы `pharmacy`
--

DROP TABLE IF EXISTS `pharmacy`;
CREATE TABLE IF NOT EXISTS `pharmacy` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `ph_name` varchar(255) NOT NULL,
  `address`  varchar(255) NOT NULL,
  `phone` varchar(255) NOT NULL,
  `manager_name` varchar(255) NOT NULL,
  `open_year` int(4) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;

--
-- Дамп данных таблицы `flight`
--

INSERT INTO `pharmacy` (`ph_name`, `address`, `phone`, `manager_name`, `open_year`) VALUES
('Фарма', 'Советская, 102', '28-34-85', 'Иванов', 1985),
('Бережная', 'Первомайская, 16', '38-56-99', 'Сидоров', 1988),
('Авиценна', 'Ленина, 18', '30-27-58', 'Петров', 2001),
('Айболит', 'Баумана, 78', '94-23-45', 'Москвин', 2008),
('Аптека №1', 'Мира, 4', '72-49-18', 'Казаков', 1989),
('Аптека №2', 'Первомайская, 123', '30-56-29', 'Комаров', 1990),
('Аптека №3', 'Дружбы, 56', '05-78-23', 'Ефимов',2012),
('Аптека №4', 'Петрова, 52', '37-56-29', 'Алешин', 2005),
('Аптека №5', 'Первомайская, 89', '49-25-56', 'Федоров', 1975),
('Аптека №6', 'Ленина, 17', '90-99-39', 'Андреев', 2004);

-- --------------------------------------------------------

--
-- Структура таблицы `medicament`
--

DROP TABLE IF EXISTS `medicament`;
CREATE TABLE IF NOT EXISTS `medicament` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `med_name` varchar(255) NOT NULL,
  `med_type` ENUM ('tablet','ampula', 'maz', 'miksture') NOT NULL DEFAULT 'tablet',
  `id_delivery` int(5) NOT NULL,
  `delivery_size` int(10) NOT NULL,
  `delivery_date` date NOT NULL,
  `price` int(10) NOT NULL,
  `exp` date NOT NULL,
  `remaind` int (10) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;

--
-- Дамп данных таблицы `medicament`
--

INSERT INTO `medicament` (`med_name`, `med_type`, `id_delivery`, `delivery_size`, `delivery_date`, `price`, `exp`, `remaind`) VALUES
('Аспирин', 'tablet', 1, 40, '2014-10-11', 100, '2015-11-10', 23),
('Валидол', 'tablet', 1, 50, '2014-10-11', 120, '2012-11-10', 12),
('Анти-ангин', 'ampula', 1, 60, '2014-10-11', 300, '2013-11-10', 10),
('Панадол', 'miksture', 1, 70, '2014-10-11', 500, '2015-11-10', 20),
('Преднизолон', 'tablet', 1, 80, '2014-10-11', 600, '2015-11-10', 13),
('Клофелин', 'miksture', 1, 400, '2014-10-11', 200, '2013-11-10', 34),
('Виагра', 'tablet', 1, 40, '2014-10-11', 1000, '2012-09-10', 12),
('Мазь Вишневского', 'maz', 1, 40, '2014-10-11', 45, '2015-11-10', 14),
('Аспирин', 'tablet', 2, 40, '2014-10-11', 100, '2015-11-10', 23),
('Валидол', 'tablet', 2, 50, '2014-10-11', 120, '2012-11-10', 12),
('Анти-ангин', 'ampula', 2, 60, '2014-10-11', 300, '2013-11-10', 10),
('Панадол', 'miksture', 2, 70, '2014-10-11', 500, '2015-11-10', 20),
('Преднизолон', 'tablet', 2, 80, '2014-10-11', 600, '2015-11-10', 13),
('Клофелин', 'miksture', 2, 400, '2014-10-11', 200, '2013-11-10', 34),
('Виагра', 'tablet', 2, 40, '2014-10-11', 1000, '2012-09-10', 12),
('Мазь Вишневского', 'maz', 2, 40, '2014-10-11', 45, '2015-11-10', 14),
('Аспирин', 'tablet', 3, 40, '2014-10-11', 100, '2015-11-10', 23),
('Валидол', 'tablet', 3, 50, '2014-10-11', 120, '2012-11-10', 12),
('Анти-ангин', 'ampula', 3, 60, '2014-10-11', 300, '2013-11-10', 10),
('Панадол', 'miksture', 3, 70, '2014-10-11', 500, '2015-11-10', 20),
('Преднизолон', 'tablet', 3, 80, '2014-10-11', 600, '2015-11-10', 13),
('Клофелин', 'miksture', 3, 400, '2014-10-11', 200, '2013-11-10', 34),
('Виагра', 'tablet', 3, 40, '2014-10-11', 1000, '2012-09-10', 12),
('Мазь Вишневского', 'maz', 3, 40, '2014-10-11', 45, '2015-11-10', 14),
('Аспирин', 'tablet', 4, 40, '2014-10-11', 100, '2015-11-10', 23),
('Валидол', 'tablet', 4, 50, '2014-10-11', 120, '2012-11-10', 12),
('Анти-ангин', 'ampula', 4, 60, '2014-10-11', 300, '2013-11-10', 10),
('Панадол', 'miksture', 4, 70, '2014-10-11', 500, '2015-11-10', 20),
('Преднизолон', 'tablet', 4, 80, '2014-10-11', 600, '2015-11-10', 13),
('Клофелин', 'miksture', 4, 400, '2014-10-11', 200, '2013-11-10', 34),
('Виагра', 'tablet', 4, 40, '2014-10-11', 1000, '2012-09-10', 12),
('Мазь Вишневского', 'maz', 4, 40, '2014-10-11', 45, '2015-11-10', 14),
('Аспирин', 'tablet', 5, 40, '2014-10-11', 100, '2015-11-10', 23),
('Валидол', 'tablet', 5, 50, '2014-10-11', 120, '2012-11-10', 12),
('Анти-ангин', 'ampula', 5, 60, '2014-10-11', 300, '2013-11-10', 10),
('Панадол', 'miksture', 5, 70, '2014-10-11', 500, '2015-11-10', 20),
('Преднизолон', 'tablet', 5, 80, '2014-10-11', 600, '2015-11-10', 13),
('Клофелин', 'miksture', 5, 400, '2014-10-11', 200, '2013-11-10', 34),
('Виагра', 'tablet', 5, 40, '2014-10-11', 1000, '2012-09-10', 12),
('Мазь Вишневского', 'maz', 5, 40, '2014-10-11', 45, '2015-11-10', 14),
('Аспирин', 'tablet', 6, 40, '2014-10-11', 100, '2015-11-10', 23),
('Валидол', 'tablet', 6, 50, '2014-10-11', 120, '2012-11-10', 12),
('Анти-ангин', 'ampula', 6, 60, '2014-10-11', 300, '2013-11-10', 10),
('Панадол', 'miksture', 6, 70, '2014-10-11', 500, '2015-11-10', 20),
('Преднизолон', 'tablet', 6, 80, '2014-10-11', 600, '2015-11-10', 13),
('Клофелин', 'miksture', 6, 400, '2014-10-11', 200, '2013-11-10', 34),
('Виагра', 'tablet', 6, 40, '2014-10-11', 1000, '2012-09-10', 12),
('Мазь Вишневского', 'maz', 6, 40, '2014-10-11', 45, '2015-11-10', 14);

-- --------------------------------------------------------

DROP TABLE IF EXISTS `med_pharmacy`;
CREATE TABLE IF NOT EXISTS `med_pharmacy` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `medicament_id` int(10) NOT NULL,
  `pharmacy_id` int(10) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;

--
-- Дамп данных таблицы `med_pharmacy`
--

INSERT INTO `med_pharmacy` (`medicament_id`, `pharmacy_id`) VALUES
(1, 1),
(1, 2),
(1, 3),
(1, 4),
(1, 5),
(1, 6),
(1, 7),
(1, 8),
(1, 9),
(1, 10),
(2, 1),
(2, 2),
(2, 3),
(2, 4),
(3, 7),
(3, 7),
(3, 7),
(4, 8),
(4, 9),
(4, 10),
(5, 1),
(5, 2),
(6, 3),
(6, 4),
(7, 5),
(7, 6),
(8, 7),
(8, 8),
(8, 9),
(9, 10),
(9, 1),
(10, 2),
(10, 3),
(11, 4),
(11, 5),
(11, 6),
(11, 7),
(12, 8),
(12, 9),
(13, 10),
(13, 1),
(14, 2),
(15, 3),
(15, 4),
(16, 5),
(16, 6),
(16, 7),
(17, 8),
(17, 9),
(18, 10),
(18, 1),
(19, 2),
(20, 3),
(21, 4),
(22, 5),
(23, 6),
(24, 7),
(25, 8),
(26, 9),
(26, 10),
(27, 1),
(28, 2),
(29, 3),
(30, 4),
(30, 5),
(31, 6),
(31, 7),
(32, 8),
(32, 9),
(33, 10),
(33, 1),
(34, 2),
(35, 3),
(36, 4),
(37, 5),
(37, 6),
(38, 7),
(39, 8),
(40, 9),
(41, 10),
(41, 1),
(42, 2),
(43, 3),
(43, 1),
(43, 2),
(43, 3),
(44, 4),
(44, 5),
(44, 6),
(45, 7),
(45, 8),
(45, 9),
(46, 10),
(43, 4),
(44, 5),
(45, 6),
(46, 7),
(47, 8),
(47, 9),
(48, 10),
(48, 1),
(48, 2),
(49, 3),
(49, 4),
(49, 5),
(49, 6),
(49, 7),
(49, 8),
(49, 9),
(49, 10);




/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
